"""

1. Написати програму, яка вміє переводити температуру з C в Фаренгейтів і Кельвінів.
Наприклад: дана температура в Цельсіях 25 С
Фаренгейт: 45.9F - вважається за формулою (C * 9/5) + 32
Кельвіни: 298.16K - вважається за формулою C + 273.16
Користувач вводить температуру в градусах Цельсіях, програма выводить температуру в Фаренгейтах та Кельвін.

"""

try:
    celsius = int(
        input("Введіть градуси в (°C) Цельсіях, щоб отримати значення в Фаренгейтах (°F) та Кельвінах (°K): "))

    farengeyt = (celsius * 9 / 5) + 32
    kelvin = celsius + 273.15

    print(f"{celsius}°C по Цельсію це: {farengeyt}°F по Фаренгейту та {kelvin}°K по Кельвіну.")

except ValueError as error:
    print("Введіть ціле число!")
