"""

2.Змішано V1 літрів води з температурою T1 та V2 літрів з температурою T2.
Написати програму, яка порахує об'єм і температуру суміші,
що вийшла обчислюється за формулою (v1*t1 + v2*t2) / (v1 + v2)
Всі параметри виводяться в консолі, вивести обʼєм та температуру

"""

try:
    v1 = float(input("Введіть значення літрів V1: "))
    t1 = float(input("Введіть значення градусів T1: "))
    v2 = float(input("Введіть значення літрів V2: "))
    t2 = float(input("Введіть значення градусів T2: "))

    v = v1 + v2
    t = (v1 * t1 + v2 * t2) / v

    print(f"Об'єм суміші: {v} л")
    print(f"Температура суміші: {t}°C Цельсія")

except ValueError:
    print("Введені дані мають невірний формат. Будь ласка, введіть числа у форматі 0.0")
