"""

5. Користувач водить текст через пробіл. Конвертувати текст у список.
Вивести останні 3 елементи зі списку, якщо список містить менше 3-х елементів,
вивести повідомлення про те що кількість елементів менша за 3 і вказати кількість елементів поточного списку

"""

text = input("Введіть текст: ")

text = text.replace(",", '').replace(".", '').replace("-", '').replace(":", '').replace("!", '').replace("?", '').replace('"', '').split()

if len(text) < 3:
    print(f"Кількість елементів менша за 3. У вашому тексті {len(text)} слів(елементів)")
else:
    print(text[-3], text[-2], text[-1])
