"""    Купівля будинку

Опис класової структури

Є Людина, характеристиками якої є:
    Ім'я
    Вік
    Наявність грошей
    Наявність власного житла

Людина може:
    Надати інформацію про себе
    Заробити гроші
    Купити будинок

Також є Дім, до властивостей якого відносяться:
    Площа
    Вартість

Для Будинку можна:
    Застосувати знижку на покупку
    Також є невеликий типовий будинок, обов'язковою площею 40м2.


Завдання:

Клас Human

1. Створіть клас Human.
2. Визначте для нього два статичні атрибути: default_name та default_age.
3. Створіть метод __init__(), який, крім self, приймає ще два параметри: name і age.
Для цих параметрів вкажіть значення за замовчанням, використовуючи атрибути default_name та default_age.
У методі __init__() визначте чотири атрибути: Публічні - name та age. Приватні - money та house.
4. Реалізуйте довідковий метод info(), який виводитиме поля name, age, house і money.
5. Реалізуйте довідковий статичний метод default_info(), який виводитиме статичні атрибути default_name та default_age.
6. Реалізуйте приватний метод make_deal(), який відповідатиме за технічну реалізацію купівлі будинку:
зменшувати кількість грошей на рахунку та привласнювати посилання на щойно куплений будинок.
Як аргументи даний метод приймає об'єкт будинку та його ціну.
7. Реалізуйте метод earn_money(), який збільшує значення якості money.
8. Реалізуйте метод buy_house(), який перевірятиме, що людина має достатньо грошей для покупки, і здійснювати угоду.
Якщо грошей надто мало – потрібно вивести попередження в консоль.
Параметри методу: посилання на будинок та розмір знижки

Клас House

1. Створіть клас House
2. Створіть метод __init__() і визначте всередині нього два атрибути: _area та _price.
Свої початкові значення вони набувають з параметрів методу __init__()
3. Створіть метод final_price(), який приймає як параметр розмір знижки та повертає ціну з урахуванням даної знижки.

Клас SmallHouse

1. Створіть клас SmallHouse, успадкувавши його функціонал від класу House
2. Усередині класу SmallHouse перевизначте метод __init__() так, щоб він створював об'єкт із площею 40м2
3. В конструкції реалізувати:
    a. Викличте довідковий метод default_info() для класу Human()
    b. Створіть об'єкт класу Human
    c. Виведіть довідкову інформацію про створений об'єкт (викличте метод info()).
    d. Створіть об'єкт класу SmallHouse
    e. Спробуйте купити створений будинок, переконайтеся в отриманні попередження.
    f. Виправте фінансове становище об'єкта - викличте метод earn_money()
    g. Знову спробуйте купити будинок
    h. Подивіться, як змінилося стан об'єкта класу Human   """


from Lesson_11.class_house import House
from Lesson_11.class_human import Human
from Lesson_11.class_smallHouse import SmallHouse


if __name__ == '__main__':

    try:

        print(f"Викличте довідковий метод default_info() для класу Human():")
        Human.default_info()

        print(f"\nСтворіть об'єкт класу Human:")
        human = Human(name="Kate", age=28)

        print(f"{human}")

        print(f"\nВиведіть довідкову інформацію про створений об'єкт (викличте метод info()):")
        human.info()

        print(f"\nЗмінити дані покупця:")
        human.change_info(name="Kateryna")
        human.info()

        print(f"\nСтворіть об'єкт класу SmallHouse:")
        small_house = SmallHouse(price=30000)
        small_house.show_the_characteristics_of_the_house()

        print(f"\nСтворіть об'єкт класу House:")
        house = House(area=120, price=280000)
        house.show_the_characteristics_of_the_house()

        print(f"\nСпробуйте купити створений будинок, переконайтеся в отриманні попередження:")
        human.buy_house(small_house, 50)
        human.buy_house(house, 100)

        print(f"\nВиправте фінансове становище об'єкта - викличте метод earn_money():")
        human.earn_money(120000)

        print(f"\nЗнову спробуйте купити будинок:")
        human.buy_house(small_house, 50)

        print(f"\nПодивіться, як змінився стан об'єкта класу Human:")
        human.info()

    except Exception as error:
        print(error)
