print("--------------------------------------------------Завдання 1--------------------------------------------------")

# 1. Написати програму, яка вміє переводити температуру з C в Фаренгетів і Кельвінів.
# Наприклад: дана температура в Цельсіях 25 С
# Фаренгейт: 45.9F - вважається за формулою (C * 9/5) + 32
# Кельвіни: 298.16K - вважається за формулою C + 273.16
# Користувач вводить температуру в градусах Цельсіях, програма выводить температуру в Фаренгейтах та Кельвін.

try:
    celsius = int(
        input("Введіть градуси в (°C) Цельсіях, щоб отримати значення в Фаренгейтах (°F) та Кельвінах (°K): "))

    farengeyt = (celsius * 9 / 5) + 32
    kelvin = celsius + 273.15

    print(f"{celsius}°C по Цельсію це: {farengeyt}°F по Фаренгейту та {kelvin}°K по Кельвіну.")

except ValueError as error:
    print("Введіть ціле число!")

print("--------------------------------------------------Завдання 2--------------------------------------------------")

# 2.Змішано V1 літрів води з температурою T1 та V2 літрів з температурою T2.
# Написати програму, яка порахує об'єм і температуру суміші,
# що вийшла обчислюється за формулою (v1*t1 + v2*t2) / (v1 + v2)
# Всі параметри виводяться в консолі, вивести обьєм та температуру

try:
    v1 = float(input("Введіть значення літрів V1: "))
    t1 = float(input("Введіть значення градусів T1: "))
    v2 = float(input("Введіть значення літрів V2: "))
    t2 = float(input("Введіть значення градусів T2: "))

    v = v1 + v2
    t = (v1 * t1 + v2 * t2) / v

    print(f"Об'єм суміші: {v} л")
    print(f"Температура суміші: {t}°C Цельсія")

except ValueError:
    print("Введені дані мають неправильний формат. Будь ласка, введіть числа у форматі 0.0")

print("--------------------------------------------------Завдання 3--------------------------------------------------")

# 3. Написати програму для підрахунку конвертації валюти:
# UAH --> USD
# USD --> UAH
# UAH --> EUR
# EUR --> UAH

USD = 36.57
EUR = 40.42

try:
    amount = float(input("Введіть суму: "))
    currency_from = int(
        input("Оберіть цифру від 1 до 3 з якої валюти конвертувати: \n1 - UAH, \n2 - USD, \n3 - EUR: \n"))
    currency_to = int(input("Оберіть цифру від 1 до 3 в яку конвертувати: \n1 - UAH, \n2 - USD, \n3 - EUR: \n"))

    if currency_from == 1 and currency_to == 2:
        print(f"{amount} UAH = {amount / USD} USD за курсом НБУ")
    elif currency_from == 2 and currency_to == 1:
        print(f"{amount} USD = {amount * USD} UAH за курсом НБУ")
    elif currency_from == 1 and currency_to == 3:
        print(f"{amount} UAH = {amount / EUR} EUR за курсом НБУ")
    elif currency_from == 3 and currency_to == 1:
        print(f"{amount} EUR = {amount * USD} UAH за курсом НБУ")
    elif currency_from == 2 and currency_to == 3:
        print(f"{amount} USD = {amount / 1.11} EUR за курсом НБУ")
    elif currency_from == 3 and currency_to == 2:
        print(f"{amount} EUR = {amount * 1.11} USD за курсом НБУ")
    else:
        print(f"Неможливо конвертувати обрані варіанти.")

except ValueError:
    print("Введено невірне значення суми або номеру валюти.")

print("--------------------------------------------------Завдання 4--------------------------------------------------")

# 4.Написать калькулятор с основными операциями(+, -, *, /)
# Користувач вводить два числа та арифметичну операцію

x = float(input("Введіть перше число:"))
y = float(input("Введіть друге число:"))

operation = input("Введіть операцію, яку треба виконати: (+, -, *, /)")


def calc(x, y, operation):
    try:
        if operation == "+":
            return x + y
        elif operation == "-":
            return x - y
        elif operation == "*":
            return x * y
        elif operation == "/":
            if y == 0:
                return print("Ділення на 0 неможливе")
            else:
                return x / y
        else:
            return print("Введено невірний знак арифметичної операції.")
    except ValueError:
        print("Введено невірне значення числа.")


result = calc(x, y, operation)
if result is not None:
    print(f"Результат: {result}")
