import re

print("--------------------------------------------------Завдання 1--------------------------------------------------")

# 1. Користувач вводить слово, якщо це слово є поліндромом, вивести '+', інакше '-'


word = input("Введіть слово: ")

if not word:
    print("Слово не може бути порожнім")
elif re.search('[^a-zA-Zа-яА-ЯіІїЇ-]', word):
    print("Слово не може містити цифри та символи")
elif word == word[::-1]:
    print("+")
else:
    print("-")

print("--------------------------------------------------Завдання 2--------------------------------------------------")

# 2. Користувач вводить текст і слово, яке потрібно знайти, якщо це слово є в тексті, вивести 'YES', інакше 'NO'


text = input("Введіть текст: ")
search_word = input("Введіть слово: ")
text = re.sub(r'[^\w\s-]', ' ', text)

if search_word in text.split():
    print("YES")
else:
    print("NO")


print("--------------------------------------------------Завдання 3--------------------------------------------------")

# 3. Користувач водить рядок. Якщо він починається на 'abc', замінити їх на 'www', інакше додати в кінець рядка 'zzz'.


text = input("Введіть текст: ")

if text.startswith("abc"):
    text = text.replace("abc", "www")
else:
    text += "zzz"

print(text)


print("--------------------------------------------------Завдання 4--------------------------------------------------")

# 4. Написати валідатор для пошти.
# Користувач вводить пошту, а програма повинна перевірити, що в пошті є символ '@' і '.',
# і якщо це так, вивести "YES", інакше "NO"


def validate_email(email):
    if re.search('[а-яА-Я]', email):
        return 'NO. Помилка: email містить кирилицю'
    if re.search('[^a-zA-Zа-яА-Я0-9.@_-]', email):
        return 'NO. Помилка: email містить заборонені символи'
    if not re.search('@', email):
        return 'NO. Помилка: email не містить символ @'
    if not re.search('[a-zA-Z0-9]+\.[a-zA-Z]{2,}', email):
        return 'NO. Помилка: email не містить домен'
    if len(email) > 25:
        return 'NO. Помилка: email має бути не довше, ніж 25 символів'
    return True


email = input("Введіть email: ")
is_valid = validate_email(email)

if is_valid:
    print(f'YES. Email "{email}" валідний')
else:
    print(is_valid)


print("--------------------------------------------------Завдання 5--------------------------------------------------")

# 5. Користувач водить текст через пробіл. Конвертувати текст у список.
# Вивести останні 3 елементи зі списку, якщо список містить менше 3-х елементів,
# вивести повідомлення про те що кількість елементів менша за 3 і вказати кількість елементів поточного списку


text = input("Введіть текст: ")

text = text.replace(",", '').replace(".", '').replace("-", '').replace(":", '').replace("!", '').replace("?", '').replace('"', '').split()

if len(text) < 3:
    print(f"Кількість елементів менша за 3. У вашому тексті {len(text)} слів(елементів)")
else:
    print(text[-3], text[-2], text[-1])