"""    Купівля будинку

Опис класової структури

Є Людина, характеристиками якої є:
    Ім'я
    Вік
    Наявність грошей
    Наявність власного житла

Людина може:
    Надати інформацію про себе
    Заробити гроші
    Купити будинок

Також є Дім, до властивостей якого відносяться:
    Площа
    Вартість

Для Будинку можна:
    Застосувати знижку на покупку
    Також є невеликий типовий будинок, обов'язковою площею 40м2.


Завдання:

Клас SmallHouse

1. Створіть клас SmallHouse, успадкувавши його функціонал від класу House
2. Усередині класу SmallHouse перевизначте метод __init__() так, щоб він створював об'єкт із площею 40м2

"""
from Les_11_OOP_Buy_house.class_house import House


class SmallHouse(House):
    def __init__(self, price: int = 30000):
        super().__init__(area=40, price=price)
