"""    Купівля будинку

Опис класової структури

Є Людина, характеристиками якої є:
    Ім'я
    Вік
    Наявність грошей
    Наявність власного житла

Людина може:
    Надати інформацію про себе
    Заробити гроші
    Купити будинок

Також є Дім, до властивостей якого відносяться:
    Площа
    Вартість

Для Будинку можна:
    Застосувати знижку на покупку
    Також є невеликий типовий будинок, обов'язковою площею 40м2.

Клас House

1. Створіть клас House
2. Створіть метод __init__() і визначте всередині нього два атрибути: _area та _price.
Свої початкові значення вони набувають з параметрів методу __init__()
3. Створіть метод final_price(), який приймає як параметр розмір знижки та повертає ціну з урахуванням даної знижки.

"""


class House:

    def __init__(self, area: float = 40, price: int = 50000):
        self._area = area
        self._price = price

    def final_price(self, discount: int = 0):
        if discount > 100:
            raise ValueError("Знижка не може бути більша, ніж 100%")
        elif discount < 0:
            raise ValueError("Знижка не може бути менша, ніж 0%")
        else:
            return self._price * (1 - (discount/100))

    def show_the_characteristics_of_the_house(self):
        print(f"Площа: {self._area}")
        print(f"Ціна: {self._price}")
